<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE> PhpCompta Manuel d'utilisation: Vue G&eacute;n&eacute;ral</TITLE>
 <LINK HREF="manuel-fr-2.html" REL=next>

 <LINK HREF="manuel-fr.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="manuel-fr-2.html">Next</A>
Previous
<A HREF="manuel-fr.html#toc1">Contents</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="manuel-fr.html#toc1">Vue G&eacute;n&eacute;ral</A></H2>

<H2><A NAME="ss1.1">1.1</A> <A HREF="manuel-fr.html#toc1.1">D&eacute;finition des termes</A>
</H2>

<P>
<UL>
<LI> Gestion : art de g&eacute;rer une entreprise ou une activit&eacute; d'ind&eacute;pendant</LI>
<LI> Comptabilit&eacute; : tenue de journaux qui sont l'historique des op&eacute;rations faites
par une entreprise ou un ind&eacute;pendant</LI>
<LI> Cat&eacute;gorie de fiches : Ensemble de fiche qui ont un point en commun
exemple : Fourniture bureau est un ensemble des fiches bic, papiers, t&eacute;l&eacute;phone, &eacute;lectricit&eacute;...</LI>
<LI> Fiche : chaque fiche, correspond &agrave; un &eacute;l&eacute;ment: un fournisseur, un client, un article</LI>
<LI> Journaux Comptables : Il existe 3 journaux minimum et  indispensables &agrave; la tenue de la
comptabilit&eacute;, il s'agit du journal des ventes qui contient toutes les ventes effectu&eacute;es, journal
d'achat qui contient tous les achats effectu&eacute;s, journal financier qui contient toutes les op&eacute;rations
financi&egrave;res (banques, caisses)</LI>
<LI> Postes Comptables : afin de simplifier, chaque type d'op&eacute;ration &agrave; un poste comptable, c'est
un chiffre dans un tableaux, exemple en Belgique 5500 repr&eacute;sente les comptes bancaires, 600 les
achats de fournitures... Ces postes comptables ne sont pas les m&ecirc;mes dans tous les pays. Ils sont
regroup&eacute;s dans un plan comptable. En g&eacute;n&eacute;ral, le plan comptable se subdivise en 6 grandes familles 
<UL>
<LI>1.  Les comptes de capital  (immobilis&eacute;)</LI>
<LI>2.  Les immobilisations corporelle (Actif a plus d'un an)</LI>
<LI>3.  Les Stocks et commandes</LI>
<LI>4.  Les comptes de tiers (clients, fournisseurs,tva)</LI>
<LI>5.  Les comptes d'actifs (compte en banque,caisse...)</LI>
<LI>6.  Les charges d'exploitations</LI>
<LI>7.  Les produits d'exploitations.</LI>
</UL>
</LI>
<LI> D&eacute;bit et cr&eacute;dit
Les postes comptables sont en partie double, l'une est le d&eacute;bit l'autre est le cr&eacute;dit.
Les actifs diminuent quand le cr&eacute;dit augmente, les comptes de passifs diminuent quand
le d&eacute;bit augmente. Par exemple, si un compte en banque est d&eacute;bit&eacute; il augmente, mais dans
la vie courante, votre compte en banque est une dette que votre banque a envers vous, donc
quand sa dette augmente on dit que le compte est cr&eacute;dit&eacute; mais dans votre comptabilit&eacute;, cela
correspond &agrave; l'inverse: de votre point de vue, votre compte en banque est une cr&eacute;ance sur 
votre banque donc s'il augmente, il est d&eacute;bit&eacute; !!! Si vous trouvez que c'est curieux, c'est
tout-&agrave;-fait normal.</LI>
</UL>
</P>
<H2><A NAME="ss1.2">1.2</A> <A HREF="manuel-fr.html#toc1.2">Logiciel de comptabilit&eacute; ou de gestion ?</A>
</H2>

<H3>D&eacute;finition</H3>

<P>La comptabilit&eacute; consiste, de la mani&egrave;re pr&eacute;vue par les lois sur la comptabilit&eacute;,
&agrave; enregistrer toutes les op&eacute;rations  d'une activit&eacute; commerciale, industrielle ou artisanale.</P>
<P>La grande diff&eacute;rence avec la gestion, est que la comptabilit&eacute; est tenue
en suivant des lois pr&eacute;cises, qui malheureusement changent suivant le  pays.</P>
<P>De plus, elle doit entre autre permettre les d&eacute;clarations
fiscales, permettre des analyses bilantaires et surtout &ecirc;tre conforme &agrave;  la l&eacute;gislation.</P>
<P>Ce n'est pas le cas, de la gestion, la gestion consiste &agrave; g&eacute;rer une entreprise ou une activit&eacute;
d'ind&eacute;pendant, ce qui inclut aussi la gestion du courrier, du personnel...</P>
<P>En bref, la comptabilit&eacute; est guid&eacute; par la l&eacute;gislation tandis que la
gestion par la pratique. Un programme de comptabilit&eacute; peut rendre les
services d'un programme de gestion et parfois les programmes de
gestion peut rendre les services d'un programme de comptabilit&eacute;. La
limite est floue et discutable.</P>
<HR>
<A HREF="manuel-fr-2.html">Next</A>
Previous
<A HREF="manuel-fr.html#toc1">Contents</A>
</BODY>
</HTML>
