<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE> PhpCompta Manuel d'utilisation: Le module de gestion</TITLE>
 <LINK HREF="manuel-fr-8.html" REL=next>
 <LINK HREF="manuel-fr-6.html" REL=previous>
 <LINK HREF="manuel-fr.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="manuel-fr-8.html">Next</A>
<A HREF="manuel-fr-6.html">Previous</A>
<A HREF="manuel-fr.html#toc7">Contents</A>
<HR>
<H2><A NAME="s7">7.</A> <A HREF="manuel-fr.html#toc7">Le module de gestion</A></H2>

<P> Le module de gestion, comprend en partie la comptabilit&eacute; et
surtout le suivi des clients, fournisseurs,... Il permet aussi la
cr&eacute;ation de facture, ou d'autre documents voir param&egrave;tre 
<A HREF="manuel-fr-8.html#param_document">param_document</A></P>


<H2><A NAME="ss7.1">7.1</A> <A HREF="manuel-fr.html#toc7.1">Menu : clients</A>
</H2>

<P> En s&eacute;lectionnant cette option, vous allez directement voir la
liste des clients que vous avez. En cliquant sur le premier &eacute;l&eacute;ment de
la colonne, vous pourrez modifier la fiche client. </P>

<P>Dans la 3i&egrave;me colonne, vous avez les actions
<UL>
<LI> C pour avoir la liste des contacts</LI>
<LI> A pour acc&egrave;der &agrave; toutes la correspondance avec ce client</LI>
<LI> F pour acc&egrave;der &agrave; toutes les factures au nom de ce client</LI>
</UL>
</P>

<P>Ajout de client en cliquant sur le bouton ajout</P>

<P>Modification d'un client en cliquant sur son quickcode</P>

<H2><A NAME="ss7.2">7.2</A> <A HREF="manuel-fr.html#toc7.2">Menu Facture</A>
</H2>

<P> Par d&eacute;faut le premier journal est ouvert, et vous propose
d'encoder une facture, cela se passe dans la m&ecirc;me fa&ccedil;on que dans le
module de comptabilit&eacute; sauf que vous pouvez ici g&eacute;n&eacute;rer une facture et
l'imprimer.</P>

<P>Si vous avez charg&eacute; un mod&eacute;le pour g&eacute;n&eacute;rer les factures, PhpCompta
vous proposera avant de sauver l'op&eacute;ration de g&eacute;n&eacute;rer une facture.</P>

<P> Pour ajouter des mod&egrave;les de facture, il faut aller dans le module
Param&egrave;tre
<A HREF="manuel-fr-8.html#parametre">Module Param&egrave;tre</A>.</P>

<P>A la derni&egrave;re &eacute;tape, PhpCompta vous permet de charger un fichier, si vous avez g&eacute;n&eacute;r&eacute; une 
facture, celle-ci sera alors remplac&eacute;e.</P>

<H2><A NAME="ss7.3">7.3</A> <A HREF="manuel-fr.html#toc7.3">Menu D&eacute;pense</A>
</H2>

<P> Exactement comme dans le module comptable, sauf qu'aucun document n'est
g&eacute;n&eacute;r&eacute; cependant vous pouvez charger une pi&egrave;ce justificative.</P>

<H2><A NAME="ss7.4">7.4</A> <A HREF="manuel-fr.html#toc7.4">Contact</A>
</H2>

<P> Dans une companie ou dans une administration, vous pouvez avoir
plusieurs personnes de contact, dans ce cas vous utiliserez les fiches
contacts. Elles n'ont pas de poste comptable normalement, mais 
vous pourriez en ajouter via le menu fiche 
<A HREF="manuel-fr-6.html#avance_fiche">fiche</A></P>


<H2><A NAME="ss7.5">7.5</A> <A HREF="manuel-fr.html#toc7.5">Administration</A>
</H2>

<P>Administrations des finances ou une autre, vous avez besoin de
suivre le courrier que vous entretenez avec eux. Que ce soit pour
charger les documents que vous envoyez ou que vous recevez, il vaut
toujours mieux garder une trace de toute vos communications avec eux. </P>


<H2><A NAME="ss7.6">7.6</A> <A HREF="manuel-fr.html#toc7.6">Suivi Courrier</A>
</H2>

<P>Comme le dit le titre, garde une trace de toutes les communications
re&ccedil;ues ou envoy&eacute;es. </P>

<P> Apr&egrave;s avoir encod&eacute; un document, vous pouvez soit directement le lier &agrave; un autre, 
si vous connaissez la r&eacute;f&eacute;rence (vous pouvez faire une recherche dans une autre fen&ecirc;tre)
ou vous ouvrez un document existant et vous ajoutez un document qui lui sera li&eacute;.</P>

<P>Vous pouvez ici aussi g&eacute;n&eacute;rer un document ou ajouter une pi&egrave;ce justificative en 
plus de la note interne. Cette note n'est jamais repris dans le document.</P>

<HR>
<A HREF="manuel-fr-8.html">Next</A>
<A HREF="manuel-fr-6.html">Previous</A>
<A HREF="manuel-fr.html#toc7">Contents</A>
</BODY>
</HTML>
