<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE> PhpCompta Manuel d'utilisation: Module Param&egrave;tre </TITLE>
 <LINK HREF="manuel-fr-13.html" REL=previous>
 <LINK HREF="manuel-fr.html#toc14" REL=contents>
</HEAD>
<BODY>
Next
<A HREF="manuel-fr-13.html">Previous</A>
<A HREF="manuel-fr.html#toc14">Contents</A>
<HR>
<H2><A NAME="parametre"></A> <A NAME="s14">14.</A> <A HREF="manuel-fr.html#toc14">Module Param&egrave;tre </A></H2>

<H2><A NAME="ss14.1">14.1</A> <A HREF="manuel-fr.html#toc14.1">Soci&eacute;t&eacute;</A>
</H2>

<P>Ici vous indiquez les param&egrave;tres de votre soci&eacute;t&eacute;, nom,
adresse... Cela sera r&eacute;utilisez dans divers endroits.</P>

<H2><A NAME="ss14.2">14.2</A> <A HREF="manuel-fr.html#toc14.2">Devise</A>
</H2>

<P>Pas vraiment utile, vous donne la possibilit&eacute; de charger les cours
de monnaie.</P>

<H2><A NAME="ss14.3">14.3</A> <A HREF="manuel-fr.html#toc14.3">TVA</A>
</H2>

<P> Dans cette page-ci,  vous pouvez
param&egrave;trer correctement votre tva, vous pouvez ajouter ici des taux de
tva, de compl&egrave;ter la description et surtout de param&egrave;trer les postes
comptables qui doivent utiliser la tva. Ces postes sont s&eacute;par&eacute;s par
des virgules, le premier est la tva sur les achats qui doit &ecirc;tre
r&eacute;cup&eacute;r&eacute; et le second est la tva sur les ventes qui doit &ecirc;tre pay&eacute;e.</P>

<P>Ces postes seront utilis&eacute;s automatiquement avec les op&eacute;rations de
vente et d'achat.</P>

<H2><A NAME="ss14.4">14.4</A> <A HREF="manuel-fr.html#toc14.4">Poste Comptable</A>
</H2>

<P>Param&egrave;trage de certains poste comptable qui sont utilis&eacute;s &agrave; d'autres
endroits du programme, vous pouvez les modifier mais assurez-vous
qu'il existe d&eacute;j&agrave; dans votre Plan Comptable</P>
<H2><A NAME="ss14.5">14.5</A> <A HREF="manuel-fr.html#toc14.5">Fiche</A>
</H2>

<P>Quand vous cr&eacute;ez une nouvelle fiche, ou vous demande sur quel
mod&egrave;le, vous voulez vous baser. Ce sont ces mod&egrave;les qui peuvent &ecirc;tre
modifi&eacute;es ici.</P>

<P>C'est un param&egrave;trage assez d&eacute;licat, il faut mieux ne pas
le modifier si vous n'&ecirc;tes pas sur de ce que vous faites.</P>

<P>Pour l'instant, il n'est pas possible d'ajouter des fiches, sauf en
ajoutant des donn&eacute;es dans les table fiche_def_ref et attr_min, il faut
voir avec la doc. d&eacute;veloppeurs pour cela</P>

<H2><A NAME="ss14.6">14.6</A> <A HREF="manuel-fr.html#toc14.6">S&eacute;curit&eacute;</A>
</H2>

<H2><A NAME="document"></A> <A NAME="ss14.7">14.7</A> <A HREF="manuel-fr.html#toc14.7">Document </A>
</H2>


<HR>
Next
<A HREF="manuel-fr-13.html">Previous</A>
<A HREF="manuel-fr.html#toc14">Contents</A>
</BODY>
</HTML>
