<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE> PhpCompta Manuel d'utilisation: Le module de gestion</TITLE>
 <LINK HREF="manuel-fr-16.html" REL=next>
 <LINK HREF="manuel-fr-14.html" REL=previous>
 <LINK HREF="manuel-fr.html#toc15" REL=contents>
</HEAD>
<BODY>
<A HREF="manuel-fr-16.html">Next</A>
<A HREF="manuel-fr-14.html">Previous</A>
<A HREF="manuel-fr.html#toc15">Contents</A>
<HR>
<H2><A NAME="s15">15.</A> <A HREF="manuel-fr.html#toc15">Le module de gestion</A></H2>

<P> Le module de gestion, comprend en partie la comptabilit&eacute; et
surtout le suivi des clients, fournisseurs,... Il permet aussi la
cr&eacute;ation de facture, de documents qui peuvent &ecirc;tre g&eacute;n&eacute;r&eacute;.</P>


<H2><A NAME="ss15.1">15.1</A> <A HREF="manuel-fr.html#toc15.1">Menu : clients</A>
</H2>

<P> En s&eacute;lectionnant cette option, vous allez directement voir la
liste des clients que vous avez. En cliquant sur le premier &eacute;l&eacute;ment de
la colonne, vous pourrez modifier la fiche client. </P>

<P>Dans la 3i&egrave;me colonne, vous avez les actions
<UL>
<LI> C pour avoir la liste des contacts</LI>
<LI> A pour acc&egrave;der &agrave; toutes la correspondance avec ce client</LI>
<LI> F pour acc&egrave;der &agrave; toutes les factures au nom de ce client</LI>
</UL>
</P>


<H2><A NAME="ss15.2">15.2</A> <A HREF="manuel-fr.html#toc15.2">Menu Facture</A>
</H2>

<P> Par d&eacute;faut le premier journal est ouvert, et vous propose
d'encoder une facture, cela se passe dans la m&ecirc;me fa&ccedil;on que dans le
module de comptabilit&eacute; sauf que vous pouvez ici g&eacute;n&eacute;rer une facture et
l'imprimer.</P>

<P> Pour ajouter des mod&egrave;les de facture, il faut aller dans le module
Param&egrave;tre
<A HREF="manuel-fr-16.html#parametre">Module Param&egrave;tre</A>.</P>

<H2><A NAME="ss15.3">15.3</A> <A HREF="manuel-fr.html#toc15.3">Menu D&eacute;pense</A>
</H2>

<P> Exactement comme dans le module comptable </P>


<H2><A NAME="ss15.4">15.4</A> <A HREF="manuel-fr.html#toc15.4">Contact</A>
</H2>

<P> Dans une companie ou dans une administration, vous pouvez avoir
plusieurs personnes de contact, dans ce cas vous utiliserez les fiches
contacts. </P>


<H2><A NAME="ss15.5">15.5</A> <A HREF="manuel-fr.html#toc15.5">Administration</A>
</H2>

<P>Administrations des finances ou une autre, vous avez besoin de
suivre le courrier que vous entretenez avec eux. Que ce soit pour
charger les documents que vous envoyez ou que vous recevez, il vaut
toujours mieux garder une trace de toute vos communications avec eux. </P>


<H2><A NAME="ss15.6">15.6</A> <A HREF="manuel-fr.html#toc15.6">Suivi Courrier</A>
</H2>




<HR>
<A HREF="manuel-fr-16.html">Next</A>
<A HREF="manuel-fr-14.html">Previous</A>
<A HREF="manuel-fr.html#toc15">Contents</A>
</BODY>
</HTML>
